МПР/src/Documents/ВводОстатковПрослеживаемыхИмпортныхТоваров/ВводОстатковПрослеживаемыхИмпортныхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковПрослеживаемыхИмпортныхТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТДОтсутствует</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

МПР/src/Documents/ВводОстатковПрослеживаемыхИмпортныхТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВводОстатковРасчетовСПоставщиками - документ начальных остатков.
//  ДополнительныеСвойства - Структура - дополнительные свойства выполнения операции.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка.Дата КАК Период,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Номенклатура КАК Номенклатура,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Характеристика КАК Характеристика,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Склад КАК Склад,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка.Организация КАК Организация,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Поставщик КАК Поставщик,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Договор КАК Договор
	|ПОМЕСТИТЬ ВТНомераГТДКСписанию
	|ИЗ
	|	Документ.ВводОстатковПрослеживаемыхИмпортныхТоваров.Товары КАК ВводОстатковПрослеживаемыхИмпортныхТоваровТовары
	|ГДЕ
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка.Дата КАК Период,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Номенклатура КАК Номенклатура,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Характеристика КАК Характеристика,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Склад КАК Склад,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка.Организация КАК Организация,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Поставщик КАК Поставщик,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Договор КАК Договор,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.НомерГТД КАК НомерГТД,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Количество КАК Количество,
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ
	|ИЗ
	|	Документ.ВводОстатковПрослеживаемыхИмпортныхТоваров.Товары КАК ВводОстатковПрослеживаемыхИмпортныхТоваровТовары
	|ГДЕ
	|	ВводОстатковПрослеживаемыхИмпортныхТоваровТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МИНИМУМ(ВТНомераГТДКСписанию.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВТНомераГТДКСписанию.Период,
	|	ВТНомераГТДКСписанию.Номенклатура,
	|	ВТНомераГТДКСписанию.Характеристика,
	|	ВТНомераГТДКСписанию.Склад,
	|	ВТНомераГТДКСписанию.Организация,
	|	ВТНомераГТДКСписанию.Поставщик,
	|	ВТНомераГТДКСписанию.Договор,
	|	ТоварыОрганизацийОстатки.НомерГТД,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток,
	|	0
	|ИЗ
	|	ВТНомераГТДКСписанию КАК ВТНомераГТДКСписанию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				&Период,
	|				(Номенклатура, Характеристика, Склад, Организация, Поставщик, Договор) В
	|					(ВЫБРАТЬ
	|						ВТНомераГТДКСписанию.Номенклатура,
	|						ВТНомераГТДКСписанию.Характеристика,
	|						ВТНомераГТДКСписанию.Склад,
	|						ВТНомераГТДКСписанию.Организация,
	|						ВТНомераГТДКСписанию.Поставщик,
	|						ВТНомераГТДКСписанию.Договор
	|					ИЗ
	|						ВТНомераГТДКСписанию)) КАК ТоварыОрганизацийОстатки
	|		ПО ВТНомераГТДКСписанию.Номенклатура = ТоварыОрганизацийОстатки.Номенклатура
	|			И ВТНомераГТДКСписанию.Характеристика = ТоварыОрганизацийОстатки.Характеристика
	|			И ВТНомераГТДКСписанию.Склад = ТоварыОрганизацийОстатки.Склад
	|			И ВТНомераГТДКСписанию.Организация = ТоварыОрганизацийОстатки.Организация
	|			И ВТНомераГТДКСписанию.Поставщик = ТоварыОрганизацийОстатки.Поставщик
	|			И ВТНомераГТДКСписанию.Договор = ТоварыОрганизацийОстатки.Договор
	|ГДЕ
	|	ТоварыОрганизацийОстатки.КоличествоПоРНПТОстаток = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНомераГТДКСписанию.Период,
	|	ВТНомераГТДКСписанию.Номенклатура,
	|	ВТНомераГТДКСписанию.Характеристика,
	|	ВТНомераГТДКСписанию.Склад,
	|	ВТНомераГТДКСписанию.Организация,
	|	ВТНомераГТДКСписанию.Поставщик,
	|	ВТНомераГТДКСписанию.Договор,
	|	ТоварыОрганизацийОстатки.НомерГТД,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток");
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылка.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТоварыОрганизаций", Результат[1].Выгрузить());
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
